{{- /* The macos image for github actions has these packages preinstalled and it is dumb */ -}}
{{ if (and (eq .chezmoi.os "darwin") (not .ci)) }}
brew "awscli"
brew "golang"
{{ end }}

brew "act"
brew "ansible"
brew "asdf"
brew "chezmoi"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gpg"
brew "jq"
brew "k9s"
brew "localstack"
brew "mas"
brew "mise"
brew "node@18"
brew "opentofu"
brew "pdm"
brew "poetry"
brew "pulumi"
brew "sox" 
brew "saml2aws"
brew "sslscan"
brew "telnet"
brew "terraform-docs"
brew "tflint"
brew "terraform-local"
brew "withgraphite/tap/graphite"
brew "yq"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "clickup"
cask "discord"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "messenger"
cask "notion"
cask "obsidian"
cask "perimeter81"
cask "protonvpn"
cask "qflipper"
cask "session-manager-plugin"
cask "slack"
cask "steam"
cask "spotify"
cask "tailscale"
cask "todoist"
cask "visual-studio-code"

{{/* we're going to skip mas installed apps in CI rather than sign into the app store */}}
{{ if (and (eq .chezmoi.os "darwin") (not .ci)) }}
mas "Pixelmator Pro", id: 1289583905
mas "Trello",         id: 1278508951
mas "Pages",          id: 409201541
{{ end }}

vscode "GitLab.gitlab-workflow"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-github-actions"
vscode "golang.go"
vscode "Graphite.gti-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "iliazeus.vscode-ansi"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "pulumi.pulumi-lsp-client"
vscode "vscjava.vscode-java-pack"
vscode "WakaTime.vscode-wakatime"
